In [21]:
from data_managers import *

In [16]:
save_to_csv()

In [14]:
import pandas as pd

In [17]:
data = pd.read_csv("./data/titanic_data.csv")

In [18]:
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,title
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Miss
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Master
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Miss
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Mr
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Mrs

In [19]:
data.title[0]

'Miss'

In [23]:
import yaml

In [26]:
with open("config.yaml", "r") as file:
    config_file = yaml.safe_load(file)

In [33]:
config_file["attributes"]["drop_variables"]

['name', 'ticket', 'boat', 'body', 'home.dest']

In [34]:
    name = list()
    name.append(config_file["attributes"]["drop_variables"][0])

In [35]:
name

['name']

In [22]:
 # saving the data copy into data folder
save_to_csv()
new_data = pd.read_csv(Path(config_file["path"]["DATA"]) / "titanic_data.csv")

assert (
        new_data[config_file["attributes"]["drop_variables"][0]].iat[0]
        == "Allen, Miss. Elisabeth Walton"
    )

    # ExtractLetterTransformer
    cleaning_ins = fea.Cleaning(
        variables=list(config_file["attributes"]["drop_variables"][0])
    )

    # when
    new_data_transformed = cleaning_ins.transform(X=new_data)

    # then
    assert (
        new_data_transformed[config_file["attributes"]["drop_variables"][0]].iat[0]
        == "Miss"

IndentationError: unexpected indent (3618114372.py, line 2)

In [2]:
new_data = load_data_testing()

In [3]:
new_data.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,title
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Miss
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Master
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Miss

In [63]:
save_to_csv()

In [64]:
from processing import features as fea

In [66]:
ext = fea.ExtractLetterTransformer(variables=["cabin"])

In [69]:
ext.transform(X= new_data)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,title
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B,S,2,NaN,"St Louis, MO",Miss
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C,S,11,NaN,"Montreal, PQ / Chesterville, ON",Master

In [97]:
new_data["cabin"].iat[1]

'C22 C26'

In [95]:
assert new_data["cabin"][1] == 'C22 C26'

In [81]:
new_data["cabin"] == ext.transform(X= new_data)["cabin"]

0       False
1       False
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: cabin, Length: 1309, dtype: bool

In [101]:
if "titanic_data.csv" not in [file.name for file in Path(config_file["path"]["DATA"]).iterdir()]:
    new_data = load_data_testing()
    new_data.to_csv(Path(config_file["path"]["DATA"]) / "titanic_data.csv", index= False)
else:
    pass

In [98]:
import pandas as pd

In [103]:
pd.read_csv(Path(config_file["path"]["DATA"])/"titanic_data.csv")

,Unnamed: 0,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,title
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Miss
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Master
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Miss
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Mr
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,Miss
1305,1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,Miss
1306,1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,Mr
1307,1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,Mr
1308,1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,Mr

In [24]:
def armstrongNumber(arr):
	no = 0
	for i in arr:
		arr_str = str(i)
		list_arr = list(arr_str)
		for ele in list_arr:
			no += int(ele)**3
		if no == i:
			print("It is an ARMSTRONG number")
		else:
			print("It is NOT an ARMSTRONG number")
	
armstrongNumber([153,123,367])

It is an ARMSTRONG number
It is NOT an ARMSTRONG number
It is NOT an ARMSTRONG number

In [17]:
for i in [153,123,367]:
	arr_str = str(i)
	list_arr = list(arr_str)
    
	for i in list_arr:
	    no += int(i)**3
	if no == arr:
		print("It is an ARMSTRONG number")
	else:
		print("It is NOT an ARMSTRONG number")

print(list_arr)

IndentationError: unindent does not match any outer indentation level (<tokenize>, line 4)

In [9]:
list("367")

['3', '6', '7']